Revit 2027 API
BuiltInFailures.WallJoinRoofFailures.NoUptoRoofForWall Property
 Highlighted wall is set to be "Up to roof", however there is no roof above it that can be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoUptoRoofForWall { get; }
Public Shared ReadOnly Property NoUptoRoofForWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoUptoRoofForWall {
	FailureDefinitionId^ get ();
}
static member NoUptoRoofForWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace